app/controllers/api/v1/facts_controller.rb

SELECT "facts".* FROM "facts"
---
    def index
        @facts = Fact.all

INSERT INTO "facts" ("user_id", "task", "likes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["task", "Dance"], ["likes", 1], ["created_at", "2021-11-23 13:32:08.787537"], ["updated_at", "2021-11-23 13:32:08.787537"]]
---
    def create
        @fact = Fact.new(fact_params)
        if @fact.save

UPDATE "facts" SET "task" = $1, "updated_at" = $2 WHERE "facts"."id" = $3  [["task", "Dance5"], ["updated_at", "2021-11-23 13:47:15.895555"], ["id", 2]]
---
    def update
        find_fact
        if @fact
            @fact.update(fact_params)

SELECT "facts".* FROM "facts" WHERE "facts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_fact
        @fact = Fact.find(params[:id])